{"Posts/Introduction":{"title":"Introduction","links":["DiscourseGraph/PTN---Discourse-Graph-Models","DiscourseGraph/QUE---What-would-our-scholarly-communication-infrastructure-look-like-today-if-we-started-from-scratch,-but-with-all-of-the-tools-and-infrastructures-we-have-available-to-us-today","DiscourseGraph/@cartwrightEvidenceBasedPolicyPractical2012","DiscourseGraph/@shumScholOntoOntologybasedDigital2000","DiscourseGraph/@clarkMicropublicationsSemanticModel2014","DiscourseGraph/ART---Micropublication-model","DiscourseGraph/@toulminUsesArgument2003","DiscourseGraph/@harsDesigningScientificKnowledge2001","@chanStepsInfrastructureScholarly2024"],"tags":[],"content":"I am curious about the question of argumentation schemes as a model for scholarly communication infrastructure.\nI think that effective synthesis would be more commonplace if we structured our scholarly communication infrastructure in terms of explicit Discourse Graph Models instead of or in addition to the existing document-centric infrastructure. In other words, my answer to the question QUE - What would our scholarly communication infrastructure look like today if we started from scratch, but with all of the tools and infrastructures we have available to us today? is at least “a discourse-centric one”!\nWhy do I think this?\nA discourse graph model seems at least on the surface like a perfect match for the kinds of operations we want to do in order to do synthesis.\nSo there’s a theoretical / prior case for doing this. For example, reading things like @cartwrightEvidenceBasedPolicyPractical2012 helps to make plain just what these operations are, which I can then juxtapose against affordances in the existing infrastructure. The arguments are also made in various bits and pieces of reviews of prior papers, often as backing for proposing a discourse-centric model. @shumScholOntoOntologybasedDigital2000 makes an intuitive example-based case by laying out examples of queries we’d like to do when doing synthesis. @clarkMicropublicationsSemanticModel2014 makes a brief argument for their proposed ART - Micropublication model based on explicit reference to @toulminUsesArgument2003, and hypothesized use cases and worked examples. @harsDesigningScientificKnowledge2001 is theory, and a nice one at that, in a similar spirit of me drawing the line from something like @cartwrightEvidenceBasedPolicyPractical2012 to “ok how then should the infrastructure be structured?”\nThe argument from here is that if it’s easier (or perhaps even newly possible) to do those operations, we do them more, and voila, we do better synthesis.\nOverall, I think this theoretical case is pretty strong. But two key uncertainties remain for me.\nFirst, what is the empirical case that this should be done? In other words, what empirical evidence do we have to suppose that the promised gains (from theory and intuition) of implementing discourse graphs will hold?\nI’m curious about this in particular because a discourse-centric infrastructure is very much not mainstream. I’ve also had conversations with folks within the HCI and hypertext communities that were excited about this sort of infrastructure in the 1980’s to early/mid 2000’s, who have described a sort of “moving on” from this idea in those communities. I would like to revisit the empirical evidence base to rule out the possibility that the promised gains of discourse-centric infrastructure are smoke and mirrors, or that the juice is not worth the squeeze. I have my own experience and empirical data (e.g., in @chanStepsInfrastructureScholarly2024) that points in a hopeful direction, but I’d like to put that in context with the overall weight of evidence.\nReviewing this empirical evidence base is tricky and sort of a chicken and egg problem, because we don’t have it (where it = the whole infrastructure available for widespread, authentic usage in practice), so we don’t really have direct tests of it yet from that perspective. But we can get at it by looking at it in a decomposed way, digging into effects on an individual level, or from scoped information retrieval experiments.\nSecond, how might this be done? In other words, what systems/combinations of design patterns, artifacts, and infrastructure would enable and sustain a discourse-centric infrastructure?"},"index":{"title":"Home","links":[],"tags":[],"content":"Welcome! This website is an experimental “living synthesis” optimized for synthesis of ideas around new infrastructures for common knowledge.\nThe living synthesis is structured around a “discourse graph” of claims, evidence, and arguments that can be recombined in various ways to surface new insights. The goal is to explore how we can better structure and share knowledge in a way that is open, collaborative, and dynamic."}}